test_results_20251018_185450/ab_balance_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/merchant/balance
Document Length:        65 bytes

Concurrency Level:      10
Time taken for tests:   4.133 seconds
Complete requests:      100
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Non-2xx responses:      2
Total transferred:      52782 bytes
Total body sent:        33400
HTML transferred:       6550 bytes
Requests per second:    24.19 [#/sec] (mean)
Time per request:       413.329 [ms] (mean)
Time per request:       41.333 [ms] (mean, across all concurrent requests)
Transfer rate:          12.47 [Kbytes/sec] received
                        7.89 kb/s sent
                        20.36 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      121  273 171.9    243    1271
Processing:    46   99  73.1     87     591
Waiting:       46   78  27.5     72     208
Total:        166  372 196.6    336    1371

Percentage of the requests served within a certain time (ms)
  50%    336
  66%    376
  75%    414
  80%    442
  90%    530
  95%    673
  98%   1281
  99%   1371
 100%   1371 (longest request)