test_results_20251018_185450/ab_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        65 bytes

Concurrency Level:      10
Time taken for tests:   4.265 seconds
Complete requests:      100
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Non-2xx responses:      8
Total transferred:      51228 bytes
Total body sent:        56200
HTML transferred:       6700 bytes
Requests per second:    23.45 [#/sec] (mean)
Time per request:       426.474 [ms] (mean)
Time per request:       42.647 [ms] (mean, across all concurrent requests)
Transfer rate:          11.73 [Kbytes/sec] received
                        12.87 kb/s sent
                        24.60 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      121  289 173.6    244    1142
Processing:    48   91  53.8     82     399
Waiting:       48   86  43.6     76     385
Total:        171  379 185.2    334    1195

Percentage of the requests served within a certain time (ms)
  50%    334
  66%    384
  75%    418
  80%    475
  90%    575
  95%    703
  98%   1172
  99%   1195
 100%   1195 (longest request)