test_results_20251018_185450/ab_query_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/query
Document Length:        65 bytes

Concurrency Level:      10
Time taken for tests:   4.513 seconds
Complete requests:      100
Failed requests:        5
   (Connect: 0, Receive: 0, Length: 5, Exceptions: 0)
Non-2xx responses:      5
Total transferred:      52005 bytes
Total body sent:        37400
HTML transferred:       6625 bytes
Requests per second:    22.16 [#/sec] (mean)
Time per request:       451.333 [ms] (mean)
Time per request:       45.133 [ms] (mean, across all concurrent requests)
Transfer rate:          11.25 [Kbytes/sec] received
                        8.09 kb/s sent
                        19.34 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      126  307 294.6    256    2573
Processing:    46   98  67.3     86     486
Waiting:       46   88  59.0     76     486
Total:        179  404 312.2    366    2642

Percentage of the requests served within a certain time (ms)
  50%    366
  66%    399
  75%    426
  80%    458
  90%    580
  95%    850
  98%   1523
  99%   2642
 100%   2642 (longest request)