test_results_20251018_185450/stress_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient)


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        65 bytes

Concurrency Level:      50
Time taken for tests:   5.657 seconds
Complete requests:      500
Failed requests:        51
   (Connect: 0, Receive: 0, Length: 51, Exceptions: 0)
Non-2xx responses:      51
Total transferred:      253291 bytes
Total body sent:        281000
HTML transferred:       33775 bytes
Requests per second:    88.39 [#/sec] (mean)
Time per request:       565.650 [ms] (mean)
Time per request:       11.313 [ms] (mean, across all concurrent requests)
Transfer rate:          43.73 [Kbytes/sec] received
                        48.51 kb/s sent
                        92.24 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      121  373 273.7    287    2597
Processing:    44  149 138.6    102     950
Waiting:       44  110 106.6     83     683
Total:        168  523 325.7    424    2759

Percentage of the requests served within a certain time (ms)
  50%    424
  66%    544
  75%    631
  80%    771
  90%    931
  95%   1152
  98%   1480
  99%   1690
 100%   2759 (longest request)